import React from "react";
import Feature from "../../components/Home/Feature";

function Home() {
    const features = [
        {
            title: 'Централізована Координація',
            content: "Ми забезпечуємо централізовану платформу, де добровольці, рятувальні служби та організації можуть об'єднати свої зусилля. Це сприяє кращій організації пошукових операцій та ефективнішій координації зусиль."
        },
        {
            title: 'Інформаційна Підтримка',
            content: "Наша платформа надає доступ до важливої інформації про зниклих осіб, включаючи фотографії, описи та останні відомості про їх місцеперебування. Це допомагає зосередити увагу на конкретних пошукових завданнях."
        },
        {
            title: 'Гнучкість та Легкість Використання',
            content: "Наша платформа проста у використанні і гнучка. Ви можете легко створювати та керувати пошуковими запитами, спілкуватися з іншими учасниками та отримувати необхідну підтримку."
        }
    ]

    return (
        <main>
            <section className="intro">
                <div className="intro__left">
                    <img src="/images/intro.png" alt="Допоможи знайти зниклих"/>
                </div>
                <div className="intro__right">
                    <h2>Допоможи знайти – разом ми сильніші</h2>
                    <p>
                        Наша платформа є центром об'єднання зусиль людей з усього світу, які прагнуть знайти
                        та повернути додому зниклих у зоні військового конфлікту. Тут добровольці, рятувальні служби та
                        громадські організації знаходяться пліч-о-пліч, щоб забезпечити максимальну ефективність пошуку.
                    </p>
                    <button>Переглянути публікації</button>
                </div>
            </section>
            <section className="features">
                {features.map((item) => (
                    <Feature key={item.title} {...item}/>
                ))}
            </section>
        </main>
    )
}

export default Home;
